* Day 6: Guard Gallivant ---

The Historians use their fancy device again, this time to whisk you all away to
the North Pole prototype suit manufacturing lab... in the year 1518! It turns
out that having direct access to history is very convenient for a group of
historians.

You still have to be careful of time paradoxes, and so it will be important to
avoid anyone from 1518 while The Historians search for the Chief. Unfortunately,
a single guard is patrolling this part of the lab.

Maybe you can work out where the *guard* will go ahead of time so that The
Historians can search safely?

You start by making a map (your puzzle input) of the situation. For example:

#+begin_example
....#.....
.........#
..........
..#.......
.......#..
..........
.#..^.....
........#.
#.........
......#...
#+end_example

The map shows the current position of the guard with ~^~ (to indicate the guard is
currently facing *up* from the perspective of the map). Any *obstructions* -
crates, desks, alchemical reactors, etc. - are shown as ~#~.

Lab guards in 1518 follow a very strict patrol protocol which involves
repeatedly following these steps:

 - If there is something directly in front of you, turn right 90 degrees.
 - Otherwise, take a step forward. Following the above protocol, the guard moves
   up several times until she reaches an obstacle (in this case, a pile of
   failed suit prototypes):

#+begin_example
....#.....
....^....#
..........
..#.......
.......#..
..........
.#........
........#.
#.........
......#...
#+end_example

Because there is now an obstacle in front of the guard, she turns right before
continuing straight in her new facing direction:

#+begin_example
....#.....
........>#
..........
..#.......
.......#..
..........
.#........
........#.
#.........
......#...
#+end_example


Reaching another obstacle (a spool of several *very* long polymers), she turns
right again and continues downward:

#+begin_example
....#.....
.........#
..........
..#.......
.......#..
..........
.#......v.
........#.
#.........
......#...
#+end_example

This process continues for a while, but the guard eventually leaves the mapped
area (after walking past a tank of universal solvent):

#+begin_example
....#.....
.........#
..........
..#.......
.......#..
..........
.#........
........#.
#.........
......#v..
#+end_example

By predicting the guard's route, you can determine which specific positions in
the lab will be in the patrol path. *Including the guard's starting position*,
the positions visited by the guard before leaving the area are marked with an X:

#+begin_example
....#.....
....XXXXX#
....X...X.
..#.X...X.
..XXXXX#X.
..X.X.X.X.
.#XXXXXXX.
.XXXXXXX#.
#XXXXXXX..
......#X..
#+end_example

In this example, the guard will visit ~41~ distinct positions on your map.

Predict the path of the guard. How many distinct positions will the guard visit
before leaving the mapped area?



#+name: task05_1
#+header: :var fndata="data.txt"
#+begin_src ruby
  $dbg = ""

  up =    [0,-1]
  down =  [0,1]
  left =  [-1,0]
  right = [1,0]

  def move( a, b )
    return [ a[0]+b[0], a[1]+b[1] ]
  end

  def obstacle?( obstacles, p )
    return obstacles.include?( p )
  end

  def off_map?( p, mapsize )
    if p[0] < 0 or p[1] < 0 or p[0] >= mapsize[0] or p[1] >= mapsize[1]
      return true
    end
    return false
  end

  def viz_map( map_size, obstacles, seen )
    m = [];

    map_size[1].times do
      m.append "." * map_size[0]
    end

    obstacles.each do |o|
      m[o[1]][o[0]] = '#'
    end

    seen.each do |s|
      m[s[1]][s[0]] = 'X'
    end

    m.join("\n") + "\n"
  end

  raw_data = File.read(fndata)

  sum = 0

  obstacles = []
  guard = []
  guard_dir = up
  map_size = [raw_data.lines[0].length-1,raw_data.lines.length]
  raw_data.each_line.with_index do |l,y|
    l.each_char.with_index do |c,x|
      case c
          when '#'
            obstacles.append( [x,y] )
          when '^'
            guard = [x,y]
      end
    end
  end

  seen = [guard.clone]

  $dbg += viz_map( map_size, obstacles, seen )
  $dbg += "Obstacles #{obstacles}\n"
  $dbg += "Map size  #{map_size}\n"
  $dbg += "Guard     #{guard}\n"

  on_map = true
  a = 0

  while on_map #and a < 10000
    a+=1
    npos = move( guard, guard_dir )
    if off_map?( npos, map_size )
      on_map = false
    else
      if( obstacle?( obstacles, npos ) )
        guard_dir = case guard_dir
            when up
              right
            when right
              down
            when down
              left
            when left
              up
                    end
      else
        guard = npos
        if !seen.include?( guard )
          seen.append guard
        end
      end
    end
  end

  $dbg += viz_map( map_size, obstacles, seen )
  #$dbg += "path      #{seen}\n"
  $dbg += "result    #{seen.length}\n"

  $dbg
#+end_src

#+RESULTS: task05_1
#+begin_example
..#.....................#............#....#...........#...............................#.....#.....................................
.................#............................#.............##..#...............................#....#..#.........#...............
.............................................##.........................................#....................#...............#...#
...##....................#...............#.....#....................#......##..............#............................#....#....
.................................#..#..............#...........#.............#..#........................#............#...........
.................#.........................#...........................#........................#........................#........
...#....................................#....#.........#................#...............#.....#................#.....#............
.............#.#..........................................................#...#..................#....#.......#.....#...#.........
.....#........................#....##...#............................................................#............................
..................#...#.........................................#..................#.............................#.#........#.....
......#...............................#.#..........##..#...........#.........................#.......#....................#.......
.................................#..............#...............#........#..........#.........#............#.........#.......#...#
..#..#............#...#.....................#...............#............#.#........................#........#...............#....
..............#..#.#........................#.........#...........##.......#..........#.....................#..............#...#..
..........................#.................##...................................#....#.........#.................................
..................#..#........#....#...............#..............#.......#.......#......................................#..#...#.
..........#.#.................#.........#...................#.......................##......#....................#.......#........
..........#.........#...#......................................................................#.....#............#........#......
...##.............#...........................................................#..#....................##.#...#.#..#.........#..#..
.....#......#.............................#.......#...#...#...............#.....#............#........#..#.#......................
........#................#.........#.......................................................................#..........#...........
.......#........................................#..........#...............................#..#...................................
..................##.......#.......#.....#............#.......#...#.........#....##...............#..#.............#..........#...
.......#...........#...........#...........................#.............#.........#..#........................#.##...............
.....................................................................#........#....#...........................................#..
....#...........#......#.........#....................................#.................................#......#..................
...#........................................#..#...............................#.....................#.#......#...................
..#.....#.................................#.................#....#............................................#......#............
...................................................##...........#.......#.............#.................#.......#.................
..........................................................##..............#....#....#.............#...............................
........................................................#.....................................#................................#..
..............##....#..#..........#...........#......#..#....#.......#................#............................#..#...#.......
..........................#....................#.................................................#................................
#................................................#.....................#..#...............##........#...#...#.........#...........
...........#.................................#..#....................#.#.......#..........................#.......#.......#.......
..............................#......#......#.................#.................#.................#.#.............#..#.#..........
.......................#....................#....................................#.....#.#.......#............................#...
...............................................................................................#.#................................
#..................#.....#...............................#..............#...#.....................................................
..........................................................#.................................................#.....................
..........#.........................#.....................................................#.........#..........#................#.
........#..............#..#......................................#.........#............#.................................#.......
.......#.........................................................#.........#................#...............................#.....
...........#............................................#...#.............................#.....X................................#
................#.............#...#..............................#..................................#.............................
.........................................................................................................#........................
.................................................#........#.......................#.#.....#......................#................
.........#.........#...#....................................................#.....................................................
##.##..#...................................#......................................................................................
.................#...........................................................................................#........#...........
.........................................................................#........................#....#......................#...
..............#......................#........#..........................#.........#..............................................
.......................#............................................................................##............................
.....#.................#........#...#...............#.............................#......................#........................
....#...................................................................................#............##...........................
................#............................#............................................#.......................................
.......................................................................................................#......#...................
......................................................................................#...#.......................................
...............................................#........#..........#............................#..............#.......#..........
..............#.....................#........#..#............................#...#..#.#...................................#.......
..........#...............................#............................#...........................................#..............
....#............#.#....#......................................................................#..................................
.......................#.......................#................................#..............#.....................#.........#..
...........#.........................#.............#.#........#........#..........................................#...............
.......#......................#....................#...............................#......................#...........#...........
............#.....................................................................................................................
....#.......#............................................................#.........#.............#..........#....#..........#.....
.......#.........................................................................#..................#..#....#.......#.............
............................#....#.......#......#.......#.....................#.................#.................................
.......................................................#.............#..........................#.................................
....................................#.....................................##......................#............................#..
..............#...............#....................#.......................#................#......................#..............
....................#...........................#...................................................................#.............
...#..........................#...........................#............................................................#..........
..............#.................#.............................#..#.......#.......................#.##.............................
....................#.....#...#..............................................#......#...........#.................#..#....#.......
#......................................#.....................#..#..#.#...........#.............#.................................#
.....................#...........................................................#..........#............##..........#............
.......#..................................#...............#..........#....#...................................................#...
.............#.................#...........................#..............#.................................................#.....
...............................#......................................##...................................#.#......#..........#..
.................##....................#.................................................#......................#................#
........#....................................#..........#.........................#..................#......................#.....
...#....#...........................#..............................#.#..........................#.................................
.#...................................#..#......#.................................................................#................
.................................#...........#................#.#........................#....................................##..
#..#.....##...............#................................................................#....#......#.........................#
.#....#......................................................#.........................#.......................................#..
.#..............................................#.................................................................#...............
...............#..........................................#...#...............................#.#..#.#........#...................
..............#................................#.......#..................................#.........................#........#....
.......................##..................................................#......................................................
..............................#...............................##..................................................................
#....................#...........................................................#.............................#..................
#..................................................................#...#..........................................................
#..#........#...................................#..#..........##..............#...................................................
.......................#.....................#....................................................................................
.....................#...........#.............................................................#........................#....#....
...............#............................................................................##...#..........................#.....
...#......................................#.......................................................................................
....#...........................#.........#.................................................#..........#...#........#....#........
......#....#.#............................#..........................................#........................................#...
...........#...#.............................................#......................#..................#.....................#....
...#..........#........#..........#.......#..............#.............................#.......................#................#.
...........#...............#...........................................................#..........................................
..#..........##.................................................#...#...............#.......................#...............##....
.......................#..............#.............#......................................................#..................#...
..............#..#........##..........#...................................................#.............##....................#...
...................#..................................................#................#......#.....#.........#.#...#.............
..................#.................................................#.................................................#.........#.
......................................#.#........#.....#...#..........#..............#.........................#...#..............
.................................#..............#..#.....................#................#.............#..#..#...................
.........#.......#.#..............#..#...............#.................#..................................#..#....................
.............................#....#.......##..................................................................................##..
.....................................................................................#........#.......#......#....................
........#...........#..........#..........#............................#...............#........#.#...........................#...
.#.................#...#..............#...#...................#........#...............#..........................................
.........#............................................##........#......#.....................#.......................#............
.......................................#..........#..#......#........#..........#..........................#....................#.
....#......#..........................#....................#.......................................#.....###.......#..............
.......#..................#....#.......................................................................#..........................
....#........................#.............................................................#.......#..........................#...
......................#.................................#..........#................#..#.........................#................
...........#....................................................#..............#...........................#......................
.....#................#........#...#....#........#............#...............#.......................#..#.........#..............
#..................................................#...........................#....#...........#.................................
....#.#.....................................#.#...............#................#....................................#.............
............#....................#.#.#...............................................#...................##.......................
...##..............#........................#.............#.......#...........#.#.##..............................#....##.........
......#...........#....................................................#.........................##...............................
Obstacles [[2, 0], [24, 0], [37, 0], [42, 0], [54, 0], [86, 0], [92, 0], [17, 1], [46, 1], [60, 1], [61, 1], [64, 1], [96, 1], [101, 1], [104, 1], [114, 1], [45, 2], [46, 2], [88, 2], [109, 2], [125, 2], [129, 2], [3, 3], [4, 3], [25, 3], [41, 3], [47, 3], [68, 3], [75, 3], [76, 3], [91, 3], [120, 3], [125, 3], [33, 4], [36, 4], [51, 4], [63, 4], [77, 4], [80, 4], [105, 4], [118, 4], [17, 5], [43, 5], [71, 5], [96, 5], [121, 5], [3, 6], [40, 6], [45, 6], [55, 6], [72, 6], [88, 6], [94, 6], [111, 6], [117, 6], [13, 7], [15, 7], [74, 7], [78, 7], [97, 7], [102, 7], [110, 7], [116, 7], [120, 7], [5, 8], [30, 8], [35, 8], [36, 8], [40, 8], [101, 8], [18, 9], [22, 9], [64, 9], [83, 9], [113, 9], [115, 9], [124, 9], [6, 10], [38, 10], [40, 10], [51, 10], [52, 10], [55, 10], [67, 10], [93, 10], [101, 10], [122, 10], [33, 11], [48, 11], [64, 11], [73, 11], [84, 11], [94, 11], [107, 11], [117, 11], [125, 11], [129, 11], [2, 12], [5, 12], [18, 12], [22, 12], [44, 12], [60, 12], [73, 12], [75, 12], [100, 12], [109, 12], [125, 12], [14, 13], [17, 13], [19, 13], [44, 13], [54, 13], [66, 13], [67, 13], [75, 13], [86, 13], [108, 13], [123, 13], [127, 13], [26, 14], [44, 14], [45, 14], [81, 14], [86, 14], [96, 14], [18, 15], [21, 15], [30, 15], [35, 15], [51, 15], [66, 15], [74, 15], [82, 15], [121, 15], [124, 15], [128, 15], [10, 16], [12, 16], [30, 16], [40, 16], [60, 16], [84, 16], [85, 16], [92, 16], [113, 16], [121, 16], [10, 17], [20, 17], [24, 17], [95, 17], [101, 17], [114, 17], [123, 17], [3, 18], [4, 18], [18, 18], [78, 18], [81, 18], [102, 18], [103, 18], [105, 18], [109, 18], [111, 18], [114, 18], [124, 18], [127, 18], [5, 19], [12, 19], [42, 19], [50, 19], [54, 19], [58, 19], [74, 19], [80, 19], [93, 19], [102, 19], [105, 19], [107, 19], [8, 20], [25, 20], [35, 20], [107, 20], [118, 20], [7, 21], [48, 21], [59, 21], [91, 21], [94, 21], [18, 22], [19, 22], [27, 22], [35, 22], [41, 22], [54, 22], [62, 22], [66, 22], [76, 22], [81, 22], [82, 22], [98, 22], [101, 22], [115, 22], [126, 22], [7, 23], [19, 23], [31, 23], [59, 23], [73, 23], [83, 23], [86, 23], [111, 23], [113, 23], [114, 23], [69, 24], [78, 24], [83, 24], [127, 24], [4, 25], [16, 25], [23, 25], [33, 25], [70, 25], [104, 25], [111, 25], [3, 26], [44, 26], [47, 26], [79, 26], [101, 26], [103, 26], [110, 26], [2, 27], [8, 27], [42, 27], [60, 27], [65, 27], [110, 27], [117, 27], [51, 28], [52, 28], [64, 28], [72, 28], [86, 28], [104, 28], [112, 28], [58, 29], [59, 29], [74, 29], [79, 29], [84, 29], [98, 29], [56, 30], [94, 30], [127, 30], [14, 31], [15, 31], [20, 31], [23, 31], [34, 31], [46, 31], [53, 31], [56, 31], [61, 31], [69, 31], [86, 31], [115, 31], [118, 31], [122, 31], [26, 32], [47, 32], [97, 32], [0, 33], [49, 33], [71, 33], [74, 33], [90, 33], [91, 33], [100, 33], [104, 33], [108, 33], [118, 33], [11, 34], [45, 34], [48, 34], [69, 34], [71, 34], [79, 34], [106, 34], [114, 34], [122, 34], [30, 35], [37, 35], [44, 35], [62, 35], [80, 35], [98, 35], [100, 35], [114, 35], [117, 35], [119, 35], [23, 36], [44, 36], [81, 36], [87, 36], [89, 36], [97, 36], [126, 36], [95, 37], [97, 37], [0, 38], [19, 38], [25, 38], [57, 38], [72, 38], [76, 38], [58, 39], [108, 39], [10, 40], [36, 40], [90, 40], [100, 40], [111, 40], [128, 40], [8, 41], [23, 41], [26, 41], [65, 41], [75, 41], [88, 41], [122, 41], [7, 42], [65, 42], [75, 42], [92, 42], [124, 42], [11, 43], [56, 43], [60, 43], [90, 43], [129, 43], [16, 44], [30, 44], [34, 44], [65, 44], [100, 44], [105, 45], [49, 46], [58, 46], [82, 46], [84, 46], [90, 46], [113, 46], [9, 47], [19, 47], [23, 47], [76, 47], [0, 48], [1, 48], [3, 48], [4, 48], [7, 48], [43, 48], [17, 49], [109, 49], [118, 49], [73, 50], [98, 50], [103, 50], [126, 50], [14, 51], [37, 51], [46, 51], [73, 51], [83, 51], [23, 52], [100, 52], [101, 52], [5, 53], [23, 53], [32, 53], [36, 53], [52, 53], [82, 53], [105, 53], [4, 54], [88, 54], [101, 54], [102, 54], [16, 55], [45, 55], [90, 55], [103, 56], [110, 56], [86, 57], [90, 57], [47, 58], [56, 58], [67, 58], [96, 58], [111, 58], [119, 58], [14, 59], [36, 59], [45, 59], [48, 59], [77, 59], [81, 59], [84, 59], [86, 59], [122, 59], [10, 60], [42, 60], [71, 60], [115, 60], [4, 61], [17, 61], [19, 61], [24, 61], [95, 61], [23, 62], [47, 62], [80, 62], [95, 62], [117, 62], [127, 62], [11, 63], [37, 63], [51, 63], [53, 63], [62, 63], [71, 63], [114, 63], [7, 64], [30, 64], [51, 64], [83, 64], [106, 64], [118, 64], [12, 65], [4, 66], [12, 66], [73, 66], [83, 66], [97, 66], [108, 66], [113, 66], [124, 66], [7, 67], [81, 67], [100, 67], [103, 67], [108, 67], [116, 67], [28, 68], [33, 68], [41, 68], [48, 68], [56, 68], [78, 68], [96, 68], [55, 69], [69, 69], [96, 69], [36, 70], [74, 70], [75, 70], [98, 70], [127, 70], [14, 71], [30, 71], [51, 71], [75, 71], [92, 71], [115, 71], [20, 72], [48, 72], [116, 72], [3, 73], [30, 73], [58, 73], [119, 73], [14, 74], [32, 74], [62, 74], [65, 74], [73, 74], [97, 74], [99, 74], [100, 74], [20, 75], [26, 75], [30, 75], [77, 75], [84, 75], [96, 75], [114, 75], [117, 75], [122, 75], [0, 76], [39, 76], [61, 76], [64, 76], [67, 76], [69, 76], [81, 76], [95, 76], [129, 76], [21, 77], [81, 77], [92, 77], [105, 77], [106, 77], [117, 77], [7, 78], [42, 78], [58, 78], [69, 78], [74, 78], [126, 78], [13, 79], [31, 79], [59, 79], [74, 79], [124, 79], [31, 80], [70, 80], [71, 80], [107, 80], [109, 80], [116, 80], [127, 80], [17, 81], [18, 81], [39, 81], [89, 81], [112, 81], [129, 81], [8, 82], [45, 82], [56, 82], [82, 82], [101, 82], [124, 82], [3, 83], [8, 83], [36, 83], [67, 83], [69, 83], [96, 83], [1, 84], [37, 84], [40, 84], [47, 84], [113, 84], [33, 85], [45, 85], [62, 85], [64, 85], [89, 85], [126, 85], [127, 85], [0, 86], [3, 86], [9, 86], [10, 86], [26, 86], [91, 86], [96, 86], [103, 86], [129, 86], [1, 87], [6, 87], [61, 87], [87, 87], [127, 87], [1, 88], [48, 88], [114, 88], [15, 89], [58, 89], [62, 89], [94, 89], [96, 89], [99, 89], [101, 89], [110, 89], [14, 90], [47, 90], [55, 90], [90, 90], [116, 90], [125, 90], [23, 91], [24, 91], [75, 91], [30, 92], [62, 92], [63, 92], [0, 93], [21, 93], [81, 93], [111, 93], [0, 94], [67, 94], [71, 94], [0, 95], [3, 95], [12, 95], [48, 95], [51, 95], [62, 95], [63, 95], [78, 95], [23, 96], [45, 96], [21, 97], [33, 97], [95, 97], [120, 97], [125, 97], [15, 98], [92, 98], [93, 98], [97, 98], [124, 98], [3, 99], [42, 99], [4, 100], [32, 100], [42, 100], [92, 100], [103, 100], [107, 100], [116, 100], [121, 100], [6, 101], [11, 101], [13, 101], [42, 101], [85, 101], [126, 101], [11, 102], [15, 102], [61, 102], [84, 102], [103, 102], [125, 102], [3, 103], [14, 103], [23, 103], [34, 103], [42, 103], [57, 103], [87, 103], [111, 103], [128, 103], [11, 104], [27, 104], [87, 104], [2, 105], [13, 105], [14, 105], [64, 105], [68, 105], [84, 105], [108, 105], [124, 105], [125, 105], [23, 106], [38, 106], [52, 106], [107, 106], [126, 106], [14, 107], [17, 107], [26, 107], [27, 107], [38, 107], [90, 107], [104, 107], [105, 107], [126, 107], [19, 108], [70, 108], [87, 108], [94, 108], [100, 108], [110, 108], [112, 108], [116, 108], [18, 109], [68, 109], [118, 109], [128, 109], [38, 110], [40, 110], [49, 110], [55, 110], [59, 110], [70, 110], [85, 110], [111, 110], [115, 110], [33, 111], [48, 111], [51, 111], [73, 111], [90, 111], [104, 111], [107, 111], [110, 111], [9, 112], [17, 112], [19, 112], [34, 112], [37, 112], [53, 112], [71, 112], [106, 112], [109, 112], [29, 113], [34, 113], [42, 113], [43, 113], [126, 113], [127, 113], [85, 114], [94, 114], [102, 114], [109, 114], [8, 115], [20, 115], [31, 115], [42, 115], [71, 115], [87, 115], [96, 115], [98, 115], [126, 115], [1, 116], [19, 116], [23, 116], [38, 116], [42, 116], [62, 116], [71, 116], [87, 116], [9, 117], [54, 117], [55, 117], [64, 117], [71, 117], [93, 117], [117, 117], [39, 118], [50, 118], [53, 118], [60, 118], [69, 118], [80, 118], [107, 118], [128, 118], [4, 119], [11, 119], [38, 119], [59, 119], [99, 119], [105, 119], [106, 119], [107, 119], [115, 119], [7, 120], [26, 120], [31, 120], [103, 120], [4, 121], [29, 121], [91, 121], [99, 121], [126, 121], [22, 122], [56, 122], [67, 122], [84, 122], [87, 122], [113, 122], [11, 123], [64, 123], [79, 123], [107, 123], [5, 124], [22, 124], [31, 124], [35, 124], [40, 124], [49, 124], [62, 124], [78, 124], [102, 124], [105, 124], [115, 124], [0, 125], [51, 125], [79, 125], [84, 125], [96, 125], [4, 126], [6, 126], [44, 126], [46, 126], [62, 126], [79, 126], [116, 126], [12, 127], [33, 127], [35, 127], [37, 127], [85, 127], [105, 127], [106, 127], [3, 128], [4, 128], [19, 128], [44, 128], [58, 128], [66, 128], [78, 128], [80, 128], [82, 128], [83, 128], [114, 128], [119, 128], [120, 128], [6, 129], [18, 129], [71, 129], [97, 129], [98, 129]]
Map size  [130, 130]
Guard     [96, 43]
..#.....................#............#....#...........#...............................#.....#.....................................
.................#............................#.............##..#...............................#....#..#.........#...............
.............................................##.........................................#....................#...............#...#
...##....................#...............#.....#....................#......##..............#............................#....#....
.................................#..#..............#...........#.............#..#........................#............#...........
.................#.........................#...........................#........................#........................#........
...#....................................#....#.........#................#...............#.....#................#.....#............
.............#.#..........................................................#...#..................#....#.......#.....#...#.........
.....#.......XXXXXXXXXXXXXXXXX#....##...#............................................................#............................
.............X....#...#......X......XXXXXXXXXXXXXXXXXXXXXXXXXXXX#..................#.............................#.#........#.....
......#......X...............X......X.#.#..........##..#.......X...#.........................#.......#....................#.......
.............X...............X...#..X...........#..............X#........#..........#.........#............#.........#.......#...#
..#..#.......X....#...#......X......X.......#...............#..X.........#.#........................#........#...............#....
.............X#..#.#.........X......X.......#.........#........X..##.......#..........#.....................#..............#...#..
.............X............#..X......X.......##.................X.................#....#.........#.................................
.............X....#..#.......X#....#X..............#...........X..#.......#.......#.............XXXXXXXXXXXXXXXXXXXXXXXXX#..#...#.
..........#.#X...............X#.....X...#...................#..X....................##......#...X................#......X#........
..........#..X......#...#....X......X...XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#X....#............#.....X..#......
...##........X....#..........X......X...X......................X..............#..#............X.X.....##.#...#.#..#.....X...#..#..
.....#......#X...............X......X...X.#.......#...#...#....X..........#.....#............#X.X.....#..#.#............X.........
........#...XXXXXXXXXXXXX#...X.....#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX.X..........#..........#.X.........
.......#....XX..........X....X..........X.......#..........#...X...........................#..#.X.......................X.........
............XX....##....X..#.X.....#....X#............#.......#X..#.........#....##.............X.#..#.............#....X.....#...
.......#....XX.....#....X..XXXX#........X..................#...X.........#.........#..#.........X..............#.##.....X.........
............XX..........X..X.XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#........#....#............X.......................X......#..
....#.......XX..#......#X..X.XXX.#......X......................X....X.#.........................X.......#......#........X.........
...#........XX..........X..X.XXX........X...#..#...............X....X.XXXXXXXXX#................X....#.#......#.........X.........
..#.....#...XX..........X..X.XXX........X.#.................#..X.#..X.X.......X.................X.............#......#..X.........
..XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX##..........X#...X.X.#.....X.......#.........X.......#.......#.......X.........
..X.........XX..........X..X.XXX........X.........X.......##...X....X.X...#...X#....#...........X.#.....................X.........
..X.........XX..........X..X.XXX........X.........X.....#..XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#.X.......................X......#..
..X.........XX##....#..#X..X.XXX..#.....X.....#...X..#..#..X.#.X....X#X.......X.......#......X..X..................#..#.X.#.......
..X.........XX..........X.#X.XXX........X......#..X........X...X....X.X.......X..............X..X#......................X.........
#.X.........XX..........X..X.XXX........X........#X........X...X....X.X#..#...X...........##.X..X...#...#...#.........#.X.........
..X........#XXXXXXXXXXXXXXXXXXXX........X....#..#.X........X...X....X#X#......X#.............X..X.........#.......#.....X.#.......
..X..........X..........X..X.X#X.....#..X...#.....X........X..#X....X.X.......X.#............X..X.#.#.............#..#.#X.........
..X..........X.........#X..X.X.X........X...#.....X........X...X....X.X.......X..#.....#.#...X..X#......................X.....#...
..X..........X..........X..X.X.X........X...XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#X#......................X.........
#.X..........X.....#....X#.X.X.X........X...X.....X......#.X...X....X.X.#...#.X..............XX.X.......................X.........
..X..........X..........XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#X...X....X.X.XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#...........X.........
..X.......#..X..........XX.X.X.X....#...X...X.....X......X.X...X....X.X.X.....X...........#..XX.X...#......X...#........X.......#.
..X.....#....X.........#XX#X.X.X........X...X.....X......X.X...X.#..X.X.X..#..X.........#....XX.X..........X............X.#.......
..X....#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#..X.X.X..#..X.............#XX.X..........X............X...#.....
..X.....X..#.X..........XX.X.X.X........X...X.....X.....#X.X#..XX...X.X.X.....X...........#..XX.X..........X............X........#
..X.....X..XXXXX#.......XX.X.X#X..#.....X...X.....X......X.X...XX#..X.X.X.....X..............XX.....#......X............X.........
..X.....X..X.X.X........XX.X.X.X..XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#.X............X.........
..X.....X..X.X.X........XX.X.X.X..X.....X...X....#X......X#X...XX...X.X.X.....X...#.#.....#..XX.........X..X.....#......X.........
..X.....X#.X.X.X...#...#XX.X.X.X..X.....X...X....XXXXXXXXXXXXXXXXXXXXXXXXXXX#.X..............XX.........X..X............X.........
##X##..#X..X.X.X........XX.X.X.X..X.....X..#X....XX......X.X...XX...X.X.X..X..X..............XX.........X..X............X.........
..X.....X..X.X.X.#......XX.X.X.X..X.....X..XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#........#.X.........
..X.....X..X.X.X........XX.X.X.X..X.....X..XX....XX......X.X...XX...X.X.X#.X..X..............XX...#....#X..XX...........X.....#...
..X.....X..X.X#X........XX.X.X.X..X..#..X..XX.#..XX......X.X...XX...X.X.X#.X..X....#.........XX.........X..XX...........X.........
..X.....X..X.X.X.......#XX.X.X.X..X.....X..XX.XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX##..X..XX...........X.........
..X..#..X..X.X.X.......#XX.X.X.X#.X.#...X..XX.X..XX.#....X.X...XX...X.X.X..X..X...#..........XX....X....X#.XX...........X.........
..X.#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#....XX....X.##.X..XX...........X.........
..X..X..X..X.X.X#.......XX.X.X.X..X.....X..XX#X..XX......X.X...XX...X.X.X..X..X........X..#..XX....X....X..XX...........X.........
..X..X..X..X.X.XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#X..XX.#.........X.........
..X..X..X..X.X.XX.......XX.X.X.X..X.....X..XX.X..XX......X.X...XX...X.X.X..X..X.......#X..#..XX....X..X.X..XX...........X.........
..X..X..X..X.X.XX.......XX.X.X.X..X.....X..XX.X#.XX.....#X.X...XX..#X.X.X..X..X........X.....XX.#..X..X.X..XX..#.......#X.........
..X..X..X..X.X#XX.......XX.X.X.X..X.#...X..XX#X.#XX......X.X...XX...X.X.X..X.#X..#..#.#X.....XX....X..X.X..XX..XXXXXXXXXXX#.......
..X..X..X.#XXXXXXXXXXXXXXX.X.X.X..X.....X.#XX.X..XX......X.X...XX...X.X#X..X..X........X.....XX....X..X.X..XX..X...#....XX........
..X.#X..X....X.XX#.#....#X.X.X.X..X.....X..XX.X..XX......X.X...XX...X.X.X..X..X........X.....XX#...X..X.X..XX..X........XX........
..X..X..X....X.XX......#.X.X.X.X..X.....X..XX.X#.XX......X.X...XX...X.X.X..X..X.#......X.....XX#...X..X.X..XX..X.....#..XX.....#..
..X..X..X..#.X.XX........X.X.X.X..X..#..X..XX.X..XX#.#...X.X..#XX...X.X#X..X..X........X.....XX....X..X.X..XX..X..#.....XX........
..X..X.#X....X.XX........X.X.X#X..X.....X..XX.X..XX#.XXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#...X.....XX....X..X.X.#XX..X......#.XX........
..X..X..X...#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX..X........XX........
..X.#X..X...#..XX........X.X.X.X..X.....X..XX.X..XX..X...X.X...XX...X.X.X#.X..X...X#...X.....XX..#.X..X.X..X#..X.#......XX..#.....
..X..X.#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX..#X....X.....XX....X#.X#X..X#..X....#...XX........
..X..X.........XX........X.X#X.X.#X.....X#.XX.X.#XX..X..#X.X...XX...X.X.X..X..#...X....X.....XX.#..X..X.X..X...X........XX........
..X..X.........XX........X.XXXXXXXXXXXXXXXXXXXXXXXXXXXX#.X.X...XX...X#XXXXXX......X....X.....XX.#..X..X.X..X...X........XX........
..X..X.........XX........X.XXX.X..X.#...X..XX.X..XX..XX..X.X...XX...X...X.##......X....X.....XX...#X..X.X..X...X........XX.....#..
..X..X........#XX........X.XXX#X..X.....X..XX.X..XX#.XX..X.X...XX...X...X..#......X....X....#XX....X..X.X..X...X...#....XX........
..X..X.........XX...#....X.XXX.X..X.....X..XX.X.#XX..XX..X.X...XX...X...X..XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#...XX........
..X#.X.........XX........X.XXX#X..X.....X..XX.X..XX..XX..X#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX..X.X..X...X...X...#XX........
..X..X........#XX........X.XXX.X#.X.....X..XX.X..XX..XX..X....#XX#..X...X#.X......X....X.....XX..#.##.X.X..X...X...X....XX........
..X..X.........XX...#....X#XXX#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...X...X..X.#....X.#..X.....XX.#.....X.X..X...X..#X.#..XX#.......
#.X..X.........XX...XXXXXXXXXXXXXXXXXXX#X..XX.X..XX..XX..X...#.X#..#X#..X..X.....#X....X.....XX#......X.X..X...X...X....XX.......#
..X..X.........XX...X#...X.XXX....X...X.X..XX.X..XX..XX..X.....X....X...X..X.....#X....X....#XX.......X.X##X...X...X.#..XX........
..X..X.#.......XX...X....X.XXX....X...X.X.#XX.X..XX..XX..X#....X....X#..X.#X......X....X.....XX.......X.X.XXXXXXXXXXXXXXXXXXXX#...
..X..X.......#.XX...X....X.XXX.#..X...X.X..XX.X..XX..XX..X.#...X....X...X.#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...X...X....XX..#X....
..X..X.........XX...X....X.XXX.#..X...X.X..XX.X..XX..XX..X.....X....X.##X.........X....X.....XX.......X.X.X#.#.X...X#...XX...X.#..
..X..X.........XX##.X....X.XXX....X...X#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX....X.#...XX.......X.X.X....X#..X....XX...X...#
..X..X..#......XX...X....X.XXX....X...X....XX#X..XX..XX.#X.....X....X...X.........#....X.....XX......#X.X.X....X...X....XX..#X....
..X#.X..#......XX...X....X.XXX....X.#.X....XX.X..XX..XX.XXXXXXXXXXX#X#..X..............X.....XX.#.....X.X.X....X...X....XX...X....
.#X..X.........XX...X....X.XXX....X..#X.#..XX.X#.XX..XX.XX.....X..X.XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#.X....XX...X....
..X..X.........XX...X....X.XXX...#X...X....XX#X..XX..XX.XX....#X#.X.XX..X..............X.#...XX.......X.X.X....XX..X....XX...X##..
#.X#.X...##....XX...X....X#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...#.XX.#.....X#X.X....XX..X....XX...X...#
.#X..X#...XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#.X..X.XX..X..............#.....XX.......X.X.X....XX..X....XX...X.#..
.#XXXXXXXXXXXXXXX...X....X..XX....X...X....XX.X.#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX.......X.X.X....XX.#X....XX...X....
.....X....X....#X...X....X..XX....X...X....XX.X...X..XX.XX#.X.#X..X.XX..X....................X#.#..#.#X.X.X...#XXXXXXXXXXXXXXX....
.....X....X...#.X...X....X..XX....X...X....XX.X#..X..XX#XX..X..X..X.XX..X.................#..X........X.X.X.....X..X#...XX...#....
.....X....X.....X...X..##XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX..X.XX..X..#.................X........X.X.X.....X..X....XX........
.....X....X.....X...X.......XX#...X...X....XX.X...X..XX.XX..X.##..X.XX..X....................X........X.X.X.....X..X....XX........
#....X....X.....X...X#......XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#...........X........X.X.X....#X..X....XX........
#....X....X.....X...X.......XXX...X...X....XX.X...X..XX.XX..X.....X#XX.#X.......X............X........X.X.X.....X..X....XX........
#..#.X....X.#...X...X.......XXX...X...X....XX.X.#.X#.XX.XX..X.##..X.XX..X.....#.X............X........X.X.X.....X..X....XX........
.....X....X.....X...X..#....XXX...X...X....XX#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX........
.....X....X.....X...X#......XXX..#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX.#......X.X.X.....X..X....#X...#....
.....X....X....#X...X.......XXX.......X....XX.....X..XX.XX..X.....X.XX..X.......X...........##...#....X.X.X.....X..X.....X..#.....
...#.X....X.....X...X.......XXX.......X...#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX........
....#X....X.....X...X.......XXX.#.....X...#.X.....X..XX.XX..X.....X.XX..X.......X...........#.........X#X.X#....X..X#....#........
.....X#...X#.#..X...X.......XXX.......X...#.X.....X..XX.XX..X.....X.XX..X.......X....#................X.X.X.....X..X..........#...
.....X....X#...#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX..X#....X.XX..X.......X...#.................X#X.X.....X..X.........#....
...#.X....X...#XXXXXXXX#....XXX...#...X...#.X.....X..XX.X#..X.....X.XX..X.......X......#..............X.X.X....#X..X............#.
.....X....X#...X....X.X....#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX..X.......X......#..............X.X.X.....X..X..............
..#..X....X..##XXXXXXXXXXXXXXXXXXXXXXXX.....X.....X..XX.X...X...#.X.#X..X.......X...#.................X.X.X.#...X..X........##....
.....X....X.........X.X#.....XX.......#.....X.....X.#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX.X#....X..X..........#...
.....X....X...#..#..X.X...##.XX.......#.....X.....X...X.X...X.....X..X..X.......X.........#...........X.##XXXXXXX..X..........#...
.....X....X........#X.X......XX.............X.....X...X.X...X.....X..X#.X.......X......#......#.....#.X.......#.#..X#.............
.....X....X.......#.X.X......XX.............X.....X...X.X...X.....X.#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX..#.........#.
.....X....X.........X.X......XX.......#.#...X....#X...X#X..#X.....X...#.X.......X....#................X........#...#..............
.....X....X.........X.X......XX..#..........X...#.X#..X.X...X.....X.....X#......X.........#...........X.#..#..#...................
.....X...#X......#.#XXXXXXXXXXX...#..#......X.....X..#X.X...X.....X....#X.......X.....................X...#..#....................
.....X....X...........X......#X...#.......##XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX.......................##..
.....X....X...........X.......X............XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#........#.......#......#....................
.....X..#.X.........#.X.......X#..........#X......X...X.X...X.....X....#X.......X...X..#........#.#...........................#...
.#...X....X........#..X#......X.......#...#XXXXXXXXXXXX.X...X.#...X....#X.......X...X..#..........................................
.....X...#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX...##XXXXX...#.X....#XXXXXXXXX...X........#.......................#............
.....X................X.......X........#..........#..#......#.....X..#..........#...X......................#....................#.
....#X.....#..........X.......X.......#....................#......X.............XXXXXXXXXXXXXXXXXXX#.....###.......#..............
.....X.#..............X...#...X#......XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#..........................
....#XXXXXXXXXXXXXXXXXX......#XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX......#......X#..X.......................#...
......................#...............X.................#.........X#............X...#..#..........X...X..........#................
...........#..........................X.........................#.X............#XXXXXXXXXXXXXXXXXXXXXXX....#......................
.....#................#........#...#..X.#........#............#...X...........#...................X...#..#.........#..............
#.....................................X............#..............X............#....#...........#.X...............................
....#.#...............................X.....#.#...............#...X............#....XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX#.............
............#....................#.#.#XXXXXXXXXXXXXXXXXXXXXXXXXXXXX.................X#............X......##........X..............
...##..............#........................#.............#.......#...........#.#.##XXXXXXXXXXXXXXX...............#X...##.........
......#...........#....................................................#.........................##................X..............
result    4722
#+end_example

